In [1]:
# !pip install pymysql

In [2]:
import pymysql

Wait, until server be ready

#### Connect server

In [3]:
connector = pymysql.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root'
)
cursor = connector.cursor()

#### Create database

In [4]:
cursor.execute("create database if not exists ml")

1

#### Connect database

In [5]:
cursor.execute("use ml")

0

In [6]:
connector = pymysql.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'ml',
    autocommit = True
)
cursor = connector.cursor()

#### Create table

In [7]:
query = "CREATE TABLE IF NOT EXISTS test ("
query += "id int not null auto_increment,"
query += "name VARCHAR(20),"
query += "age INTEGER,"
query += "primary key(id)"
query += ")"
cursor.execute(query)

0

#### Drop reecords

In [8]:
cursor.execute("delete from test")

0

#### Add records to table

In [9]:
cursor.execute("INSERT INTO test VALUES (1, 'Taro', 20)")
cursor.execute("INSERT INTO test VALUES (2, 'Hanako', 30)")

1

#### Read table

In [10]:
cursor.execute("SELECT * FROM test")
for row in cursor:
    print(row)

(1, 'Taro', 20)
(2, 'Hanako', 30)

#### Read df

In [11]:
import pandas as pd
df = pd.read_sql('SELECT * FROM test', connector)
df

   id    name  age
0   1    Taro   20
1   2  Hanako   30

#### Add record from df to mysql

In [12]:
df.drop(df.index, inplace=True)
df

Empty DataFrame
Columns: [id, name, age]
Index: []

In [13]:
df.loc[0] = [3, 'Jiro', 18]
df

   id  name  age
0   3  Jiro   18

In [14]:
from sqlalchemy import create_engine

In [15]:
db_name = 'ml'
mysql_server = 'localhost:3306'
mysql_user = 'root'
mysql_pass = 'root'
engine = create_engine(
    'mysql+pymysql://'+mysql_user+':' + mysql_pass + '@'+mysql_server+'/'+db_name,
    echo=False
)

In [16]:
df.to_sql(name='test', con=engine, index=False, if_exists='append')

In [17]:
df = pd.read_sql('SELECT * FROM test', connector)
df

   id    name  age
0   1    Taro   20
1   2  Hanako   30
2   3    Jiro   18